var 词典数据 = {};
var 词形变化数据 = {};
/*
for (var 文件序号 = 0; 文件序号 < 16; 文件序号++) {
    let 数据 = require('./词典数据/词典' + 文件序号).数据;
    for (var 英文 in 数据) {
        词典数据[英文] = 数据[英文];
    }
}
*/
let 数据 =require('./词典数据/词典0').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
数据 =require('./词典数据/词典1').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
数据 =require('./词典数据/词典2').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
数据 =require('./词典数据/词典3').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
数据 =require('./词典数据/词典4').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
数据 =require('./词典数据/词典5').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
数据 =require('./词典数据/词典6').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
数据 =require('./词典数据/词典7').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
数据 =require('./词典数据/词典8').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
数据 =require('./词典数据/词典9').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
数据 =require('./词典数据/词典10').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
数据 =require('./词典数据/词典11').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
数据 =require('./词典数据/词典12').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
数据 =require('./词典数据/词典13').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
数据 =require('./词典数据/词典14').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
数据 =require('./词典数据/词典15').数据
for (var 英文 in 数据){
  词典数据[英文]=数据[英文]
}
let 词形变化源数据 = require('./词典数据/词形变化').数据
for (var 英文 in 词形变化源数据) {
    词形变化数据[英文] = 词形变化源数据[英文];
}

exports.词典数据 = 词典数据;
exports.词形变化数据 = 词形变化数据;
